; domain
(define (domain blockworld-domain)
  (:requirements :strips :typing)

  (:types block)

  (:predicates
    (on ?x - block ?y - block)      ; Block x is on block y
    (ontable ?x - block)            ; Block x is on the table
    (clear ?x - block)              ; Block x is clear (nothing on it)
    (holding ?x - block)            ; Robot is holding block x
    (handempty)                     ; Robot’s hand is empty
  )

  ;; Pickup a block from the table
  (:action pickup
    :parameters (?x - block)
    :precondition (and (ontable ?x) (clear ?x) (handempty))
    :effect (and (holding ?x) (not (ontable ?x)) (not (clear ?x)) (not (handempty)))
  )

  ;; Put a block down on the table
  (:action putdown
    :parameters (?x - block)
    :precondition (holding ?x)
    :effect (and (ontable ?x) (clear ?x) (handempty) (not (holding ?x)))
  )

  ;; Stack a block on another block
  (:action stack
    :parameters (?x - block ?y - block)
    :precondition (and (holding ?x) (clear ?y))
    :effect (and (on ?x ?y) (clear ?x) (handempty) (not (holding ?x)) (not (clear ?y)))
  )

  ;; Unstack a block from another block
  (:action unstack
    :parameters (?x - block ?y - block)
    :precondition (and (on ?x ?y) (clear ?x) (handempty))
    :effect (and (holding ?x) (clear ?y) (not (on ?x ?y)) (not (clear ?x)) (not (handempty)))
  )
)

; problem
(define (problem blockworld-problem)
  (:domain blockworld-domain)

  (:objects
    A B C D - block
  )

  (:init
    (ontable A)   ; A is on the table
    (on B C)      ; B is on C
    (ontable C)   ; C is on the table
    (on D B)      ; D is on B
    (clear A)     ; A is clear
    (clear D)     ; D is clear
    (handempty)   ; Robot's hand is empty
  )

  (:goal
    (and
      (on A B)    ; A on B
      (on B C)    ; B on C
      (on C D)    ; C on D
      (ontable D) ; D on the table
    )
  )
)

; plan
1. (unstack d b)
   deleted: (on d b) (clear d) (handempty)
   added: (holding d) (clear b)
   goals met: 1 of 4
2. (putdown d)
   deleted: (holding d)
   added: (ontable d) (clear d) (handempty)
   goals met: 2 of 4
3. (unstack b c)
   deleted: (on b c) (clear b) (handempty)
   added: (holding b) (clear c)
   goals met: 1 of 4
4. (putdown b)
   deleted: (holding b)
   added: (ontable b) (clear b) (handempty)
   goals met: 1 of 4
5. (pickup c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 1 of 4
6. (stack c d)
   deleted: (holding c) (clear d)
   added: (on c d) (clear c) (handempty)
   goals met: 2 of 4
7. (pickup b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 2 of 4
8. (stack b c)
   deleted: (holding b) (clear c)
   added: (on b c) (clear b) (handempty)
   goals met: 3 of 4
9. (pickup a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 3 of 4
10. (stack a b)
   deleted: (holding a) (clear b)
   added: (on a b) (clear a) (handempty)
   goals met: 4 of 4
